Revit 2024 API
StringParameterValue Class
 A class that holds a String value of a parameter element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016 Subscription Update
Syntax
C#
public class StringParameterValue : ParameterValue
Visual Basic
Public Class StringParameterValue _
	Inherits ParameterValue
Visual C++
public ref class StringParameterValue : public ParameterValue
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ParameterValue
 Autodesk.Revit.DB.StringParameterValue
See Also
StringParameterValue Members
Autodesk.Revit.DB Namespace